# CannotDrawFilledRegionError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FilledRegionFailures..::..CannotDrawFilledRegionError Property
BuiltInFailures..::..FilledRegionFailures Class See Also
---
Can't draw [Filled Region Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawFilledRegionError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawFilledRegionError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawFilledRegionError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FilledRegionFailures Class
Autodesk.Revit.DB Namespace